---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.VisGraphicsAnnotation
source: html/820d7d69-e65b-fc10-aaae-f5a8c36a6906.htm
---
# Autodesk.Revit.DB.ParameterTypeId.VisGraphicsAnnotation Property

"V/G Overrides Annotation"

## Syntax (C#)
```csharp
public static ForgeTypeId VisGraphicsAnnotation { get; }
```